pl-sql/2-4.tex
% Created 2023-10-20 vie 23:11
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[margin=0.5in]{geometry}
\author{Agustín Alejandro Mota Hinojosa}
\date{\today}
\title{2-4 PL/SQL}
\hypersetup{
 pdfauthor={Agustín Alejandro Mota Hinojosa},
 pdftitle={2-4 PL/SQL},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Vocabulary}
\label{sec:orgf3b6d0e}
\begin{enumerate}
\item BOOLEAN Data Type
\item \%TYPE Attribute
\end{enumerate}
\section{Try It/Solve It}
\label{sec:org9111cbc}
\begin{enumerate}
\item Declarations
\begin{enumerate}
\item Which of the following variable declarations are valid?
\begin{enumerate}
\item Valid
\item Invalid
\item Invalid
\item Valid
\end{enumerate}
\item For the invalid declarations above, describe why they are invalid.
\begin{enumerate}
\item B option: All strings must be inside quotation marks.
\item C option: Variables must be initialized during declaration.
\end{enumerate}
\item Write an anonymous block in which you declare and print (on the screen) each of thevariables in 1A above, correcting the invalid declarations and adding information as needed.
\begin{minted}[]{sql}
        DECLARE
            number_of_students PLS_INTEGER := 30;
            student_name VARCHAR2(10) := 'Johnson';
            stu_per_class CONSTANT NUMBER := 1;
            today DATE := SYSDATE + 1;
        BEGIN
            DBMS_OUTPUT.PUT_LINE ('The number of students is:' || number_of_students || '.');
            DBMS_OUTPUT.PUT_LINE ('The name of the students is:' || student_name || '.');
            DBMS_OUTPUT.PUT_LINE ('The number of students per class is:' || stu_per_class || '.');
            DBMS_OUTPUT.PUT_LINE ('Tomorrows date is: ' || today || '.');
        END
\end{minted}
\end{enumerate}
\item Evaluate the variables in the following code. Answer the following questions about each variable. Is it named well? Why or why not? If it is not named well, what would be a better name and why?
\begin{minted}[]{sql}
     DECLARE
         country_name VARCHAR2(50);
         median_age  NUMBER(6, 2);
     BEGIN
     SELECT country_name, median_age INTO country_name, median_age
         FROM countries
     WHERE country_name = 'Japan';
         DBMS_OUTPUT.PUT_LINE('The median age in '|| country_name
                                   || ' is ' || median_age || '.');
     END;
\end{minted}

\textbf{The two variables have the same name as the database columns.}

\item Change the declarations in 2) above so they use the \%TYPE attribute
\begin{enumerate}
\item \texttt{country\_name wf\_countries.country\_name\%TYPE;}
\item \texttt{median\_age wf\_countries.median\_age\%TYPE;}
\end{enumerate}

\item In your own words, describe why using the \%TYPE attribute is better than hard-coding data types. Can you explain how you could run into problems in the future by hard-coding the data types of the country\textsubscript{name} and median\textsubscript{age} variables in question 2?

\textbf{It's more sustainable in the future, it brings adaptability and reduces maintenance}

\item Create the following anonymous block:
\begin{minted}[]{sql}
    BEGIN
        DBMS_OUTPUT.PUT_LINE('Hello World');
    END;
\end{minted}
\begin{enumerate}
\item Add a declarative section to this PL/SQL block. In the declarative section, declare the following variables:
\begin{enumerate}
\item A variable named TODAY of datatype DATE. Initialize TODAY with SYSDATE.
\item A variable named TOMORROW with the same datatype as TODAY. Use the \%TYPE attribute
\end{enumerate}
\begin{minted}[]{sql}
      DECLARE
          today DATE:=SYSDATE;
          tomorrow today%TYPE;
      BEGIN
          DBMS_OUTPUT.PUT_LINE('Hello World');
      END;
\end{minted}

\item In the executable section, initialize the TOMORROW variable with an expression that calculates tomorrow’s date (add 1 to the value in TODAY). Print the value of TODAY and TOMORROW after printing ‘Hello World’.
\begin{minted}[]{sql}
        DECLARE
            today DATE:=SYSDATE;
            tomorrow today%TYPE;
        BEGIN
            tomorrow := today + 1;
            DBMS_OUTPUT.PUT_LINE('Hello World');
            DBMS_OUTPUT.PUT_LINE(today);
            DBMS_OUTPUT.PUT_LINE(tomorrow);
        END;
\end{minted}
\end{enumerate}
\end{enumerate}
\end{document}